[{"id":1825870,"title":"Попиксельная обработка изображений на C#","rating":4.6,"length":"3,5 ч","url":"https://www.udemy.com/course/photosharp/","price":4590,"requirements":"Базовые знания C#, Windows Forms","description":"В этом курсе мы напишем алгоритмы различных графических фильтров: градации серого, изменение яркости и контрастности, градационная коррекция и гамма-коррекция. Каждый алгоритм пишется с нуля и сразу тестируется в программе.Далее мы напишем два алгоритма масштабирования изображения: методом ближайшего соседа и билинейной интерполяции. В конце курса есть дополнительный бонусный урок об использовании делегатов на практических примерах.В этом курсе мы напишем алгоритмы различных графических фильтров: градации серого, изменение яркости и контрастности, градационная коррекция и гамма-коррекция. Каждый алгоритм пишется с нуля и сразу тестируется в программе.Далее мы напишем два алгоритма масштабирования изображения: методом ближайшего соседа и билинейной интерполяции. В конце курса есть дополнительный бонусный урок об использовании делегатов на практических примерах.В этом курсе мы напишем алгоритмы различных графических фильтров: градации серого, изменение яркости и контрастности, градационная коррекция и гамма-коррекция. Каждый алгоритм пишется с нуля и сразу тестируется в программе.Далее мы напишем два алгоритма масштабирования изображения: методом ближайшего соседа и билинейной интерполяции. В этом курсе мы напишем алгоритмы различных графических фильтров: градации серого, изменение яркости и контрастности, градационная коррекция и гамма-коррекция. Каждый алгоритм пишется с нуля и сразу тестируется в программе.Далее мы напишем два алгоритма масштабирования изображения: методом ближайшего соседа и билинейной интерполяции. В конце курса есть дополнительный бонусный урок об использовании делегатов на практических примерах. ","authors":"Евгений Волосатов","learn":"Смогут открывать графические файлы, попиксельно их обрабатывать и сохранять.; Напишут алгоритмы изменения яркости, контрастности, цветности.; Напишут алгоритмы изменения размера и билинейной интерполяции"},{"id":3189970,"title":"Базовый SQL","rating":4.6,"length":"6,5 ч","url":"https://www.udemy.com/course/ittensive-sql-basic/","price":2990,"requirements":"Основы программирования","description":"На этом курсе вы освоите язык запросов SQL и научитесь проектировать базы данных. В курсе изучаются синтаксис SQL, создание, изменение и удаление данных и таблиц, индексы, сложные запросы и полнотекстовый поиск, вложенные запросы.В курс входит 60 отдельных уроков, 13 практикумов, 7 самостоятельных работ для закрепления материала и 30 задач-тренажеров.Вашим курсовым проектом будет проектирование базы данных для веб-приложения.","authors":"Центр digital-профессий ITtensive","learn":"Синтаксис SQL и типы данных; Базовые операции со строками и столбцами; Структура и создание таблиц в базе данных; Индексы, ограничения и ключи в таблицах; Полнотекстовый поиск; Сложные запросы и подзапросы; Группировка данных и агрегирующие функции; Многотабличные выборки; Проектирование баз данных и нормальные формы"},{"id":2146924,"title":"CS33 - программирование игр в Scratch 3","rating":4.5,"length":"4,5 hours","url":"https://www.udemy.com/course/persimon/","price":15990,"requirements":"Желание и энтузиазм","description":"Сделайте первый шаг в освоении программирования с нашим онлайн-курсом CS33 по созданию игр и проектов в Scratch - бесплатной среде программирования Массачусетского института технологий.Курс CS33 - это авторская адаптация культового курса Гарвардского университета, рассчитанная на детей старше 10 лет, их родителей и учителей. Программа составлена таким образом, что за 6 недель наших занятий вы освоите навыки, которые обычно изучают в течении 3 лет.  В игровой форме вы с нуля получите знания, достаточные для программирования собственных полноценных проектов. От простых циклов до алгоритмов с рекурсивными функциями - вместе мы пройдем путь от нуба до настоящего программиста. В нашем курсе мы уделяем особое внимание четырем ключевым навыкам, которые пригодятся не только для работы в Scratch, но и в освоении новых сред программирования:Умение создавать оптимальный кодСамый очевидный путь не всегда самый эффективный. На нашем курсе ученик познакомится с основами функций и запомнит их отличительные особенности. Это сформирует навык всегда искать оптимальный код, который выполнит задачу быстро, не используя много операционных процессов и памяти.ДебаггингНахождение и исправление ошибок в коде является одним из важных навыков программиста, который высоко ценится среди разработчиков. С нашим курсом ученик научится всегда отличить баг (ошибку) от фичи (преимущество) в созданных им алгоритмах. Анализ алгоритмовКод - это язык, на котором можно «читать» и «писать» так же, как и на любом другом языке. После нашего курса ученик легко сможет понимать сложные ветвления алгоритмов и считывать замысел «художника» — программиста в любом, даже незнакомом коде.Удовольствие от процессаПрограммирование - это творческий процесс, и удовольствие от него - вот настоящий залог будущего успеха. Программирование в Scratch - это не скучные нули и единицы с уроков информатики. В среде обитают свои персонажи, а код складывается как конструктор из блоков. Наш курс полностью геймифицировал процесс обучения - играя в игры на каждом уроке ученик освоит те же навыки, которые необходимы в IT индустрии и при создании масштабных проектов.Курс состоит из 15 насыщенных занятий и промежуточных тестов, которые позволят проверить усвоение материала. На первом вступительном занятии вы узнаете как эффективнее всего проходить этот курс, а на последнем, заключительном -  как применять свои знания дальше. Каждый ученик может присоединится к закрытой группе на фейсбук и получить не только ответы на возникающие вопросы, но и поддержку от единомышленников.До встречи на первом занятии!","authors":"Ibrohimsho Abduchaborov","learn":"Программирование и гейм-дизайн компьютерных игр и интерактивных проектов в Scratch; Структурный подход к решению задач в программировании; Scrum-планирование для создания игр и проектов; Дебаггинг (поиск ошибок в коде); Оптимизации кода; Анализ игровых алгоритмов; Рекурсивные функции, функции принимающие параметры и функции отправляющие параметры; Раскадровка проекта или игры; Зарисовка идеи и сцен игры, проекта; \"Объясни свой код резиновой уточке\" - методика используемая программистами"},{"id":1830354,"title":"Tetris","rating":4.375,"length":"6,5 ч","url":"https://www.udemy.com/course/shmoylov_tetris/","price":2990,"requirements":"Базовые знания языка программирования C#, Microsoft Visual Studio.","description":"На курсе мы пишем полностью с нуля до коробки классическую игру Тетрис.Цель игры - набрать как можно больше очков.Очки начисляются при заполнении полностью горизонтальной линии фигурами, тогда эта линия уберется и зачисляться очки. Для Вас я приготовил 17 уроков по написанию игры Тетрис, мы пройдемся по всем этапам разработки. Посмотрим, что нам будет необходимо, чтобы легко, удобно и быстро управлять игрой.Напишем несколько универсальных методов, которые помогут в работе с массивами.","authors":"Шмойлов Кирилл","learn":"Собственную игру Тетрис. Знания, для перемещения блоками элементов. Навык разработки динамических игр. Различные вариации игры: 1.\tКлассический 2.\tНа прохождение 3.\tКлассический вдвоем кооператив 4.\tКлассический вдвоем каждый сам за себя 5.\tВдвоем друг против друга (Баттл)"},{"id":3067022,"title":"SQLite ничего лишнего","rating":4.75,"length":"3 ч","url":"https://www.udemy.com/course/sqlite-m17/","price":1790,"requirements":"умение работать с текстовым редактором Блокнот","description":"установка SQLIte на компьютере;планирование структуры базы данных;создание базы данных и таблиц;SQL запросы;заполнение таблиц данными;пакетное применение INSERT INTO;изменение данных в таблицах;работа с датой и временем в SQLite;выборки SELECT ... WHERE ... ORDER;простейшая математика COUNT() SUM() AVG();использование псевдонимов;связывание таблиц через JOIN;типы JOIN и их описание;добавление полей в таблицах;изменение структуры таблиц и транзакции;хранимые процедуры и триггеры;копирование и восстановление базы;команды консоли SQLite;GUI инструменты для работы с базами данных SQLite","authors":"Валерий Жданов","learn":"СУБД SQLite, SQL запросы"},{"id":3493178,"title":"SEO: Введение в поисковую оптимизацию","rating":4.5,"length":"3,5 ч","url":"https://www.udemy.com/course/seo-an-introduction-to-search-engine-optimization/","price":1390,"requirements":"Базовый уровень подготовки и релевантный опыт","description":"Хотите понять как основные поисковые системы ранжируют ваш сайт в своих результатах поиска и как привлечь трафик? Научитесь поисковой оптимизации SEO.На этом курсе Вы познакомитесь с основными элементами поисковой оптимизации и изучите основные стратегии и тактики SEO для продвижения веб-сайтов, а также тактики, которых следует избегать, чтобы предотвратить наказание со стороны поисковых систем.Вы узнаете как создать эффективную стратегию SEO и как определить возможности улучшения поисковой оптимизации сайта.Вы поймете как важен контент-маркетинг и социальные сети для SEO и как они влияют на результаты выдачи поисковых систем.","authors":"Timur Mashnin","learn":"Вы познакомитесь с основными элементами SEO; Изучите основные стратегии и тактики SEO, используемые для увеличения органических результатов поиска веб-сайтов, а также тактики, которых следует избегать, чтобы предотвратить наказание со стороны поисковых систем; Получите представление об алгоритмах поисковых систем и о том, как они влияют на результаты поиска веб-сайтов; Вы познакомитесь с ключевыми элементами создания эффективной стратегии SEO, включая выбор ключевых слов и SEO-анализ, чтобы определить возможности улучшения поисковой оптимизации сайта; Познакомитесь с экосистемой контент-маркетинга и социальных сетей и влиянием этих каналов на результаты поиска веб-сайтов"},{"id":3023420,"title":"Регулярные выражения в Python","rating":4,"length":"1 ч","url":"https://www.udemy.com/course/ittensive-python-regular-expressions/","price":1390,"requirements":"Базовый Python","description":"На этом курсе вы освоите работу со строками при помощи регулярных выражений - формального языка работы с подстроками в тексте на основе метасимволов. В курсе изучается синтаксис регулярных выражений и базовые конструкции для поиска и замены повторяющихся в строках выражений, используя шаблоны.Большое внимание уделено практической отработке навыков на примере модуля re в Python и его методов - match, finditer, split и sub.","authors":"Центр digital-профессий ITtensive","learn":"Структура регулярного выражения; Шаблоны символов и позиций; \"Жадные\" и \"ленивые\" квантификаторы; Скобочные группы и перечисления; Модуль re: match, fiinditer, split, sub; Сложные шаблоны позиций; Аббревиатуры и повторы; Конечные автоматы"},{"id":3363680,"title":"Альтернатива Excel: работа с данными в KNIME","rating":4.75,"length":"3 ч","url":"https://www.udemy.com/course/knime-instead-of-excel/","price":1790,"requirements":"любой опыт работы с данными (с помощью любого программного обеспечения) приветствуется, но не является обязательным","description":"В любом современном бизнесе обработка данных занимает много времени и ресурсов. В большинстве компаний, особенно малых и средних, которые не могут себе позволить большие инвестиции в сложные ИТ решения, вроде хранилища данных и системы бизнес-аналитики, Microsoft Excel занимает доминирующую позицию в качестве инструмента для работы с данными. Будучи прекрасным инструментом для быстрого анализа не очень большого массива данных, Microsoft Excel тем не менее имеет ряд узких мест и плохо подходит для работы с большими массивами данных, а также не позволяет автоматизировать рутинные (повторяющиеся) задачи без знания VBA макросов. По моим многолетним практическим наблюдениям, многие люди тратят значительную часть своего рабочего дня на обработку данных и подготовку неких сводных отчетов в Excel, причем это одни и те же отчеты, которые нужно готовить периодически. Я считаю, что работа должна быть интересной и приносить удовольствие, а рутинные задачи этому не способствуют. Именно поэтому я решил создать курс по работе с KNIME, прекрасной (и, к тому же, бесплатной) платформой для работы с данными, которая будет делать рутинные задачи за Вас, высвободит время и позволив Вам заниматься действительно интересными и захватывающими задачами. Навыки программирования для использования KNIME не требуются! Итак, если Вам надоело каждый месяц тратить по три-четыре дня на подготовку одного и того же отчета, этот курс для Вас! После освоения KNIME Ваш опыт по работе с данными разделится на \"до\" и \"после\".","authors":"Alexey Mokhnatkin","learn":"работа с данными; автоматизация рутинных задач по работе с данными с помощью KNIME"},{"id":3578341,"title":"Webpack, Babel - детальное руководство по настройке","rating":4.75,"length":"5 ч","url":"https://www.udemy.com/course/webpack-babel/","price":2190,"requirements":"Базовые знания JavaScript","description":"В этом курсе вы изучите настройку современного JavaScript Front-End проектаКонечно, мы не каждый день стартуем новый проект. Но каждый раз, когда все же есть необходимость это сделать - начинается кошмар. Иы ищем готовые конфиги на Stackoverflow, копируем куски настроек из выдачи гугла и тащим кучу непонятных ошибок в консоли. Да, спустя некоторое время (час или день - как повезет), проект заведется! Но в следующий раз процесс будет точно таким же. У меня подход был именно таким, как описан выше. Точно знаю, что у моих коллег было именно так. В последствии я решил в этом разок основательно разобраться. Разобрался! Вот так получился курс :)Что Вы изучите в этом курсе?Что такое BabelПочему Babel необходимПочему Babel - это не только переделать ES6+ в ES5Для чего нужен WebpackКак его настроитьЧто такое webpack лоадеры, как из подключатьWebpack плагины и чем они от лоадеров отличаютсяWebpack Dev Server ","authors":"Vasyl Velmyk","learn":"Сборка front-end проекта с помощью Webpack; Принцип работы и настройка Babel"},{"id":3632864,"title":"React JS и Redux - быстрый курс для начинающих","rating":5,"length":"3,5 ч","url":"https://www.udemy.com/course/react-js-redux/","price":1790,"requirements":"Базовые знания HTML, CSS, Javascript","description":"Приветствую вас в обучающем курсе по разработке приложений с помощью React JS и Redux.Этот курс поможет вам за считанные часы разобраться как работает Redux, как можно настроить взаимодействие React и Redux. В этом курсе сделан акцент не на качество кода, а на простое и доступное объяснение принципов работы библиотеки Redux.  Курс идеально подойдет  новичкам, тем кто хочет получить базовые знания необходимые для разработки на React и Redux. Если ты хочешь изучить React JS и Redux и не знаешь с чего начать, то этот курс то что нужно! Весь материал подается очень доступно, мы вместе шаг за шагом начнём с самых азов и постепенно будем усложнять задачи.  В процессе вы не просто научитесь пользоваться готовыми пакетами, а также вы будете понимать как работает React в связке с Redux и как все устроено изнутри.Я просто и доступно объясняю основные принципы и приемы разработки приложений на React/Redux. Благодаря простоте объяснений вы за считанные часы освоите React/Redux и сможете создавать web приложения любого уровня сложности. В ходе курса будут рассмотрены все основные  подходы приёмы и методы которые используют при разработке React JS и Redux в том числе все новые возможности такие как хуки библиотеки Redux. В практическом разделе мы вместе по шагам прямо с чистого листа разработаем полностью рабочее single page application, научимся работать с API и базами данных. Практический раздел мы завершим тем, что разместим уже готовое рабочее web приложение на хостинге и вы сможете смело добавить его в своё портфолио. Не думай, присоединяйся! Сейчас самое время! Будет интересно! ","authors":"Evdokimov Sergio","learn":"Изучите базовые принципы построения приложений с помощью React JS + Redux; Создадите полноценное SPA на React/Redux; Поймёте как работает Redux, как могут взаимодействовать React и Redux"},{"id":3771730,"title":"React Native с нуля на практике [2021]","rating":4.25,"length":"2 ч","url":"https://www.udemy.com/course/react-native-basics-2021/","price":1390,"requirements":"Основы JavaScript; Основы React JS","description":"Добро пожаловать на курс по основам React Native!В этом курсе мы познакомимся с основами фреймворка и сделаем на практике наше первое кроссплатформенное мобильное приложение (под iOs и Android) используя всю мощь фреймворков React Native и Expo. Мы научимся работать с расположением элементов, научимся использовать красивые иконки, научимся запрашивать разрешение и получать текущую геопозицию устройства, получать и обрабатывать данные через API.Если это ваше первое знакомство с фреймворком React Native, то вы в правильном месте. По-сути вам нужно только немного знать JavaScript и уметь работать с фреймворков React и все - вам не нужно знать Java, Kotlin, Objective C или Swift.И в результате вы получите красивое и легкое кроссплатформенное приложение, которое вы сможете протестировать на своем смартфоне и показать своим друзьям!Что мы изучим из теории:ExpoОтличия React от React NativeСтили в React NativeИконкиПолучение и обработка данных от сторонних сервисов по APIДоступ к геопозиции устройстваЗапрос на предоставление доступаЧто мы будем использовать на практике:ReactExpoReact NativeAxiosOpenWeather APIПочему стоит изучить React Native:Кроссплатформенная разработка на одном языке (JavaScript) и в одном фреймворкеДоступ к нативному инструментарию мобильных устройствПростота прототипированияБыстрая разработкаМгновенное отображение изменений в мобильном приложении или в эмулятореФреймворк разрабатывается и поддерживается компанией FacebookОгромное комьюнити разработчиков по всему миру используют React Native для своих проектовОгромное количество встроенных и сторонних компонентовПеред прохождением курса убедитесь, что вы знакомы с основами JavaScript и фреймворка React. При необходимости вы можете заранее пройти другие курсы автора по данным технологиям. ","authors":"Anton Golosnichenko","learn":"React Native; Expo; Получение и обработка данных от сторонних сервисов по API; Доступ к геопозиции устройства; Запрос на предоставление доступа; Отличия React от React Native; Стили в React Native; Иконки"},{"id":3426600,"title":"Онлайн курс по HTML+CSS. Верстка сайтов для новичков","rating":4.8333335,"length":"10 ч","url":"https://www.udemy.com/course/html-css-for-beginer/","price":4990,"requirements":"Наличие компьютера; Не какой базы не надо, обучение идет с нуля, для новичков; Желание и упорство","description":"Хотите работать фронтенд разработчиком, но совсем не знакомы с программированием? Слова HTML и CSS вызывают у вас ступор? Кажется, что вам не под силу все это освоить?Тогда этот курс – то, что вам нужно. Мы обучим вас основам HTML и CSS и покажем, как верстать сайты. Вы набьете руку, создавая, анимируя и стилизуя сайты – то есть делая все то, с чем сталкивается frontend специалист.Пройдите путь от новичка до профессионального фронтенд разработчика вместе с нами!Почему стоит освоить эту профессию?Востребованность – спрос на разработчиков огромный и он постоянно растет.Высокая зарплата – доход frontend специалиста уровня Middle стартует от $1500, а Senior Developer зарабатывает до $3000 в месяц.Стабильность – отрасль веб-разработки с каждым годом развивается.Возможность работать на фрилансе – на биржах очень много заказов даже для начинающих фронтенд разработчиков.Что вам даст этот курс по HTML и CSS?вы узнаете, что такое HTML-теги и научитесь с ними работатьосвоите создание различных видов списковпознакомитесь с созданием и форматированием таблицпоработаете с изображениями и ссылкамиосвоите основные понятия CSSнаучитесь подключать таблицы стилей и шрифтыузнаете способы стилизации текста методами CSSпоработаете с градиентами и анимациейполучите представление об основных функциях программ Figma и Photoshopпознакомитесь с основами веб-дизайнанаучитесь работать с мудбордами и внутренними страницамиузнаете, что такое jQuery и подключите плагинсверстаете свой первый сайтизучите адаптивную версткупоработаете над оптимизацией файловузнаете, что такое домен и хостинг сайта и для чего они нужнынаучитесь загружать файлы сайта на серверИзучите все тонкости верстки сайтов на нашем курсе по HTML и CSS!Почему среди всех курсов по верстке сайтов стоит выбрать именно этот?Некоторые преподаватели обучают только тех, кто уже знает основы HTML и CSS. Все, что вам нужно для участия в нашем курсе – наличие компьютера, желания и немного свободного времени.Это максимально полный курс по верстке сайтов. Мы даем ученикам все необходимые знания и навыки для дальнейшей самостоятельной работы.Курс содержит большую практическую часть. В процессе обучения вы сами создадите сайт и сможете добавить свою работу в портфолио.С нами вы откроете для себя не только мир веб-разработки, но и изучите основы веб-дизайна.Все еще сомневаетесь?Мы предлагаем вам 30 дней пробного периода!Если вам не понравится курс или вы решите, что профессия фронтенд разработчика не для вас – вы сможете вернуть деньги.На этот курс действует гарантия полного возврата средств – без лишних вопросов и возражений!Если что-то пошло не так, просто запросите возврат в течение 30 дней с момента оплаты.Зарегистрируйтесь уже сейчас и гарантируйте себе место на курсе!Для кого этот курс:для всех желающих работать в ITдля тех, кого привлекает веб-разработкадля всех, кому нужно вносить изменения на сайтдля тех, кто мечтает увеличить доходдля тех, кто хочет перейти на фриланс","authors":"Skills Factory","learn":"Освоите создание веб сайтов с помощью HTML5; Изучите таблицы стиле CSS3 для стилизации вашего сайта; Анимация сайта при помощи библиотек jQuery; Создадите адаптированный сайта; Изучите основы веб-дизайна; Поймете как создать современный сайт, используя изученные технология; Сможете устроиться на работу младшего разработчика; Брать проекты на Freelance; Станите Front-end разрбаотчиком"},{"id":3365622,"title":"MQL5: Создание торговых роботов и индикаторов","rating":4.3333335,"length":"4,5 hours","url":"https://www.udemy.com/course/mql5-metatrader5-ru-v1/","price":1390,"requirements":"Базовый уровень подготовки и релевантный опыт","description":"Этот курс познакомит Вас с практическим использованием MetaQuotes Language 5 (MQL5) - языком программирования технических индикаторов, торговых роботов и вспомогательных приложений для автоматизации торговли на финансовых рынках с помощью торговой платформы MetaTrader 5.На этом курсе Вы научитесь создавать MQL5 приложения, используя как процедурное программирование, так и объектно-ориентированное программирование.Вы познакомитесь с общей структурой и свойствами технических индикаторов - MQL5 приложений, предназначенных для анализа котировок валют и акций.Научитесь использовать функции обратного вызова MQL5 для создания пользовательских индикаторов, реализуя собственные алгоритмы анализа рынка в дополнение к индикаторам, уже интегрированным в торговую платформу MetaTrader 5.Вы познакомитесь с общей структурой советников - MQL5 приложений, способных автоматически выставлять и закрывать ордера на покупку и продажу финансового инструмента, таким образом, осуществляя автоматическую торговлю в клиентском терминале торговой платформы MetaTrader 5.Научитесь использовать функции обратного вызова MQL5 для создания собственных советников, реализующих автоматическую торговую систему, имеющую привязку к определенному графику финансового инструмента.Научитесь работать в среде разработки MetaEditor, предоставляющей все современные инструменты для написания кода, включая шаблоны, сниппеты, отладку, профилировку, автозавершение и встроенное версионное хранилище MQL5 Storage.  Познакомитесь со встроенным тестером терминала MetaTrader 5, позволяющим тестировать и оптимизировать входные параметры советника с использованием исторических данных финансовых инструментов.Научитесь создавать советники с помощью мастера MQL5 Wizard, позволяющего сгенерировать код эксперта на основе готовых модулей.Познакомитесь с генетическими алгоритмами для создания самооптимизирующегося советника.","authors":"Timur Mashnin","learn":"На этом курсе Вы получите практические навыки использования специализированного языка объектно-ориентированного программирования высокого уровня MetaQuotes Language 5 (MQL5), позволяющего создавать торговых роботов и технические индикаторы для торговой платформы MetaTrader 5; Вы научитесь создавать торговых роботов — MQL5 приложения, которые могут самостоятельно анализировать котировки валют и акций и на основании этих данных торговать на финансовых рынках; Научитесь создавать пользовательские индикаторы — MQL5 приложения, предназначенные для анализа котировок валют и акций; Познакомитесь с функциями языка MQL5, необходимыми для анализа котировок, встроенными основными техническими индикаторами, а также средствами управления и контроля за торговыми позициями"},{"id":3447514,"title":"Основы Node JS","rating":3.6666667,"length":"1,5 hours","url":"https://www.udemy.com/course/node-js-b1/","price":1390,"requirements":"работа с текстовым редактором","description":"Установка Node JS и Visual Studio CodeСоздание проекта Node JSЗапуск проекта Node JS на выполнениеИспользование REPLПодключение библиотек Node JSСоздание собственных библиотек Node JSСоздание локального сервера Node JSРабота Node JS с параметрами командной строкиУстановка и настройка пакетов npmСоздание пакета при помощи npmРасширенная работа с параметрами при помощи yargsЧтение и запись в текстовый файл","authors":"Валерий Жданов","learn":"Основы работы с Node JS; Установка Node JS и Visual Studio Code; Создание проекта на Node JS; Установка пакетов npm"},{"id":3340092,"title":"Java Intro","rating":5,"length":"3 ч","url":"https://www.udemy.com/course/java-intro-dev-up/","price":1390,"requirements":"PC/Laptop; Wish to learn something interesting","description":"Taking this course will provide you with a basic foundation in Java syntax, which is the first step towards becoming a successful Java developer. You’ll learn how computers make decisions and how Java keeps track of information through variables and data types. You’ll learn to create conditional statements, methods to process information and solve problems. You’ll even learn to use IntelliJ, a Java IDE (Integrated Development Environment) that professional developers use, to build, compile, and debug your code. These are foundational programming skills. This course is the first in our Java Programming course series. After you complete this course, you'll be ready to take Object Oriented Programming in Java.","authors":"Tasha Kravchenko","learn":"Java intro"}]